go_basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-26 Thu 16:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: The Basics</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: The Basics</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org98e0413">1. Variables</a></li>
<li><a href="#org4de50f3">2. Constants</a></li>
<li><a href="#orgdc44c6d">3. Printing Constants and Variables</a></li>
<li><a href="#org6eabd01">4. Packages and imports</a></li>
<li><a href="#org2a43f1a">5. Exported names</a></li>
<li><a href="#org3aa7d8e">6. Functions, signature, return values, named results</a></li>
<li><a href="#org2e50501">7. Pointers</a></li>
<li><a href="#org8177f6b">8. Mutability</a></li>
</ul>
</div>
</div>

<div id="outline-container-org98e0413" class="outline-2">
<h2 id="org98e0413"><span class="section-number-2">1</span> Variables</h2>
<div class="outline-text-2" id="text-1">
<p>
The <b>var</b> statement declares a list of variables with the type declared last or one variable per line. Var declaration can include initializers, one per variable.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> (
        name string
        location string
        age int
)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> (
        name, location string
        age            int
)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> name string
<span style="color: #00ff00; font-weight: bold;">var</span> location string
<span style="color: #00ff00; font-weight: bold;">var</span> age int
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> (
        name string = <span style="color: #ffa500;">"Hello World"</span>
        location string = <span style="color: #ffa500;">"World"</span>
        age int = 42
)
</pre>
</div>
<p>
The type can be omited, the variable will get inferred type.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> (
        name = <span style="color: #ffa500;">"Hello World"</span><span style="background-color: #BC8383;">    </span><span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">inferred string</span>
        location = <span style="color: #ffa500;">"World"</span><span style="background-color: #BC8383;">      </span><span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">inferred string</span>
        age = 42<span style="background-color: #BC8383;">                </span><span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">inferred int</span>
)
</pre>
</div>
<p>
You can also initialize variables on the same line:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">var</span> (
        name, location, age = <span style="color: #ffa500;">"Hello World"</span>, <span style="color: #ffa500;">"World"</span>, 42
)
</pre>
</div>
<p>
Inside a functio, the <b>:=</b> short assignment statement can be used in place of a var declaration with implicit type.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        name, location := <span style="color: #ffa500;">"Hello, World"</span>, <span style="color: #ffa500;">"World"</span>
        age := 42
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s (%d) of %s"</span>, name, age, location)
}
</pre>
</div>

<pre class="example">
Hello, World (42) of World

</pre>
</div>
</div>

<div id="outline-container-org4de50f3" class="outline-2">
<h2 id="org4de50f3"><span class="section-number-2">2</span> Constants</h2>
<div class="outline-text-2" id="text-2">
<p>
Constants are declared with the <b>const</b> keyword.
<span class="underline">Constants can only be</span> <b>character</b>, <b>string</b>, <b>boolean</b>, or <b>numeric</b> values and <span class="underline">cannot be declared using <b>:=</b> syntax</span>.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">const</span> Pi = 3.14
<span style="color: #00ff00; font-weight: bold;">const</span> (
        StatusOK = 200
        StatusCreated = 201
        StatusAccepted = 202
        StatusNonAuthoritativeInfo = 203
        StatusNoContent = 204
        StatusResetContent = 205
        StatusPartialContent = 206
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc44c6d" class="outline-2">
<h2 id="orgdc44c6d"><span class="section-number-2">3</span> Printing Constants and Variables</h2>
<div class="outline-text-2" id="text-3">
<p>
While you can print the value of a variable or constant using the built-in print and println functions, the more idiomatic and flexible way is to use the fmt package. fmt.Println prints the passed in variables' values and appends a newline. fmt.Printf is used when you want to print one or multiple values using a defined format specifier.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        someValue := 6
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(someValue)
}
</pre>
</div>

<pre class="example">
6

</pre>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        someString := <span style="color: #ffa500;">"The answer is"</span>
        answerValue := 42
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s %d"</span>, someString, answerValue)
}
</pre>
</div>

<pre class="example">
The answer is 42

</pre>
</div>
</div>

<div id="outline-container-org6eabd01" class="outline-2">
<h2 id="org6eabd01"><span class="section-number-2">4</span> Packages and imports</h2>
<div class="outline-text-2" id="text-4">
<p>
Every Go program is made up of packages. Programs start runnig in package <b>main</b>. If you are writing an executable code (versus a library), then you need to define a <b>main package</b> and a <b>main() function</b> which will be the entry point to your software.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"Hello World\n"</span>)
}
</pre>
</div>
<p>
Import statements examples:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
        <span style="color: #ffa500;">"math/rand"</span>
)
</pre>
</div>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>
<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"math/random"</span>
</pre>
</div>
<p>
Usually, non standard lib packages are namespaced using web url.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"github.com/name/repo/package"</span>
</pre>
</div>
<p>
The snippet above basically tells the compiler to import the crypto package available at the github.com/name/repo/package path. It doesn’t mean that the compiler will automatically pull down the repository. You need to pull down the code yourself. The easiest way is to use the go get command provided by Go.
</p>
<div class="org-src-container">
<pre class="src src-sh">go get github.com/name/repo/package
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a43f1a" class="outline-2">
<h2 id="org2a43f1a"><span class="section-number-2">5</span> Exported names</h2>
<div class="outline-text-2" id="text-5">
<p>
After importing a package, you can refer to the names it exports (meaning variables, methods and functions that are available from outside of the package). In Go, a name is exported if it begins with a capital letter. <b>Foo</b> is an exported name, as is <b>FOO</b>. The name <b>foo</b> is not exported.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
        <span style="color: #ffa500;">"math"</span>
)

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(math.pi)
}
</pre>
</div>

<pre class="example">
# command-line-arguments
/tmp/babel-9061vPW/go-src-90611Bk.go:9: cannot refer to unexported name math.pi
/tmp/babel-9061vPW/go-src-90611Bk.go:9: undefined: math.pi

</pre>

<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(math.Pi)
}
</pre>
</div>

<pre class="example">
3.141592653589793

</pre>
</div>
</div>
