go_basics.org
* Functions, signature, return values, named results
  Function can take zero or more typed arguments. The type comes after the variable name. Functions can be defined to return any number of values that are always typed.;
#+NAME: main_add
#+BEGIN_SRC go :results none :exports none
  func main() {
          fmt.Println(add(42, 122))
  }

#+END_SRC
#+BEGIN_SRC go :results output :exports both :noweb yes
  package main

  import "fmt"

  func add(x int, y int) int {
          return x + y
  }


  <<main_add>>
#+END_SRC

#+RESULTS:
: 164
  We can declare one type that applies to both
#+BEGIN_SRC go :results output :exports both :noweb yes
  package main

  import "fmt"

  func add(x, y int) int {
          return x + y
  }

  <<main_add>>
#+END_SRC
  In the following example, the *location* function return two string values
#+NAME: main_location
#+BEGIN_SRC go :results none :exports none
  func main() {
          region, continent := location("LA")
          fmt.Printf("Matt lives in %s, %s", region, continent)
  }

#+END_SRC
  #+BEGIN_SRC go :results output :exports both :imports "fmt" :noweb yes
    func location(city string) (string, string) {
            var region string
            var continent string

            switch city {
            case "Los Angeles", "LA", "Santa Monica":
                    region, continent = "California", "North America"
            case "New York", "NYC":
                    region, continent = "New York", "North America"
            default:
                    region, continent = "Unknown", "Unknown"
            }
            return region, continent
    }

    <<main_location>>
  #+END_SRC

  #+RESULTS:
  : Matt lives in California, North America
  If the result parameters are named, a return statement without arguments returns the current values of the results. But *DO NOT USE* named return parameters because they often cause more confusion than they save time or help clarify your code.
  #+BEGIN_SRC go :results output :exports both :noweb yes :imports "fmt"
    func location(city string) (region, continent string) {
            region = city
            switch city {
            case "New York", "LA", "Chicago":
                    continent = "North America"
            default:
                    continent = "Unknown"
            }
            return
    }

    <<main_location>>
  #+END_SRC

  #+RESULTS:
  : Matt lives in LA, North America

* Pointers
  Go has pointers (like C++ references), but no pointer arithmetic. Struct fields can be accessed through a struct pointer. Note that by default Go passes arguments by value (copying the arguments), if you want to pass the arguments by reference, you need to pass pointers (or use a structure using reference values like /slices/ and /maps/). To get the pointer of a value, use the *&* symbol in front of the value; to dereference a pointer, use the *\ast* (asterisk) symbol. Methods are often defined on pointers and not values (although they can be defined on both), so you will often store a pointer in a variable as in the example below:
  #+BEGIN_SRC go :results none :exports code
    client := &http.Client{}
    resp, err := client.Get("http://gobootcamp.com")
  #+END_SRC

