go_basics.html

<div id="outline-container-org3aa7d8e" class="outline-2">
<h2 id="org3aa7d8e"><span class="section-number-2">6</span> Functions, signature, return values, named results</h2>
<div class="outline-text-2" id="text-6">
<p>
Function can take zero or more typed arguments. The type comes after the variable name. Functions can be defined to return any number of values that are always typed.;
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">add</span>(x <span style="color: #00ffff;">int</span>, y <span style="color: #00ffff;">int</span>) <span style="color: #00ffff;">int</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> x + y
}


<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #00ffff; font-weight: bold;">add</span>(42, 122))
}

</pre>
</div>

<pre class="example">
164

</pre>
<p>
We can declare one type that applies to both
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">add</span>(x, y <span style="color: #00ffff;">int</span>) <span style="color: #00ffff;">int</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> x + y
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #00ffff; font-weight: bold;">add</span>(42, 122))
}

</pre>
</div>

<pre class="example">
164

</pre>

<p>
In the following example, the <b>location</b> function return two string values
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">location</span>(city <span style="color: #00ffff;">string</span>) (<span style="color: #00ffff;">string</span>, <span style="color: #00ffff;">string</span>) {
        <span style="color: #00ff00; font-weight: bold;">var</span> region string
        <span style="color: #00ff00; font-weight: bold;">var</span> continent string

        <span style="color: #00ff00; font-weight: bold;">switch</span> city {
        <span style="color: #00ff00; font-weight: bold;">case</span> <span style="color: #ffa500;">"Los Angeles"</span>, <span style="color: #ffa500;">"LA"</span>, <span style="color: #ffa500;">"Santa Monica"</span>:
                region, continent = <span style="color: #ffa500;">"California"</span>, <span style="color: #ffa500;">"North America"</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> <span style="color: #ffa500;">"New York"</span>, <span style="color: #ffa500;">"NYC"</span>:
                region, continent = <span style="color: #ffa500;">"New York"</span>, <span style="color: #ffa500;">"North America"</span>
        <span style="color: #00ff00; font-weight: bold;">default</span>:
                region, continent = <span style="color: #ffa500;">"Unknown"</span>, <span style="color: #ffa500;">"Unknown"</span>
        }
        <span style="color: #00ff00; font-weight: bold;">return</span> region, continent
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        region, continent := <span style="color: #00ffff; font-weight: bold;">location</span>(<span style="color: #ffa500;">"LA"</span>)
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"Matt lives in %s, %s"</span>, region, continent)
}

</pre>
</div>

<pre class="example">
Matt lives in California, North America

</pre>
<p>
If the result parameters are named, a return statement without arguments returns the current values of the results. But <b>DO NOT USE</b> named return parameters because they often cause more confusion than they save time or help clarify your code.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">location</span>(city <span style="color: #00ffff;">string</span>) (region, continent <span style="color: #00ffff;">string</span>) {
        region = city
        <span style="color: #00ff00; font-weight: bold;">switch</span> city {
        <span style="color: #00ff00; font-weight: bold;">case</span> <span style="color: #ffa500;">"New York"</span>, <span style="color: #ffa500;">"LA"</span>, <span style="color: #ffa500;">"Chicago"</span>:
                continent = <span style="color: #ffa500;">"North America"</span>
        <span style="color: #00ff00; font-weight: bold;">default</span>:
                continent = <span style="color: #ffa500;">"Unknown"</span>
        }
        <span style="color: #00ff00; font-weight: bold;">return</span>
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        region, continent := <span style="color: #00ffff; font-weight: bold;">location</span>(<span style="color: #ffa500;">"LA"</span>)
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"Matt lives in %s, %s"</span>, region, continent)
}

</pre>
</div>

<pre class="example">
Matt lives in LA, North America

</pre>
</div>
</div>

<div id="outline-container-org2e50501" class="outline-2">
<h2 id="org2e50501"><span class="section-number-2">7</span> Pointers</h2>
<div class="outline-text-2" id="text-7">
<p>
Go has pointers (like C++ references), but no pointer arithmetic. Struct fields can be accessed through a struct pointer. Note that by default Go passes arguments by value (copying the arguments), if you want to pass the arguments by reference, you need to pass pointers (or use a structure using reference values like <i>slices</i> and <i>maps</i>). To get the pointer of a value, use the <b>&amp;</b> symbol in front of the value; to dereference a pointer, use the <b>&lowast;</b> (asterisk) symbol. Methods are often defined on pointers and not values (although they can be defined on both), so you will often store a pointer in a variable as in the example below:
</p>
<div class="org-src-container">
<pre class="src src-go">client := &amp;http.<span style="color: #00ffff;">Client</span>{}
resp, err := client.<span style="color: #00ffff; font-weight: bold;">Get</span>(<span style="color: #ffa500;">"http://gobootcamp.com"</span>)
</pre>
</div>
</div>
</div>
