go_basics.org
* Mutability
  In Go only constants are immutable. However because arguments are passed by value, a function receiving a value argument and mutating it, won’t mutate the original value.
#+NAME: main_newrelease
#+BEGIN_SRC go :results none :exports none
  fmt.Printf("%s has a total of %d songs\n", me.Name, me.Songs)
  fmt.Printf("%s released their %dth song\n", me.Name, newRelease(me))
  fmt.Printf("%s has a total of %d songs", me.Name, me.Songs)
#+END_SRC
#+NAME: artist_struct
#+BEGIN_SRC go :results none :exports none
  package main

  import "fmt"

  type Artist struct {
          Name, Genre string
          Songs       int
  }
#+END_SRC
  #+BEGIN_SRC go :results output :exports both :noweb yes :main no
    <<artist_struct>>

    func newRelease(a Artist) int {
            a.Songs++
            return a.Songs
    }

    func main() {
            me := Artist{Name: "Matt", Genre: "Electro", Songs: 42}
            <<main_newrelease>>
    }
  #+END_SRC

  #+RESULTS:
  : Matt has a total of 42 songs
  : Matt released their 43th song
  : Matt has a total of 42 songs
  To mutate the passed value, we need to pass it by reference, using a pointer.
  #+BEGIN_SRC go :results output :exports both :noweb yes
    <<artist_struct>>

    func newRelease(a *Artist) int {
            a.Songs++
            return a.Songs
    }

    func main() {
            me := &Artist{Name: "Matt", Genre: "Electro", Songs: 42}
            <<main_newrelease>>
    }
  #+END_SRC

  #+RESULTS:
  : Matt has a total of 42 songs
  : Matt released their 43th song
  : Matt has a total of 43 songs
