go_basics.html

<div id="outline-container-org8177f6b" class="outline-2">
<h2 id="org8177f6b"><span class="section-number-2">8</span> Mutability</h2>
<div class="outline-text-2" id="text-8">
<p>
In Go only constants are immutable. However because arguments are passed by value, a function receiving a value argument and mutating it, won’t mutate the original value.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Artist</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Name, Genre string
        Songs       int
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">newRelease</span>(a <span style="color: #00ffff;">Artist</span>) <span style="color: #00ffff;">int</span> {
        a.Songs++
        <span style="color: #00ff00; font-weight: bold;">return</span> a.Songs
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        me := <span style="color: #00ffff;">Artist</span>{Name: <span style="color: #ffa500;">"Matt"</span>, Genre: <span style="color: #ffa500;">"Electro"</span>, Songs: 42}
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s has a total of %d songs\n"</span>, me.Name, me.Songs)
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s released their %dth song\n"</span>, me.Name, <span style="color: #00ffff; font-weight: bold;">newRelease</span>(me))
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s has a total of %d songs"</span>, me.Name, me.Songs)
}
</pre>
</div>

<pre class="example">
Matt has a total of 42 songs
Matt released their 43th song
Matt has a total of 42 songs

</pre>
<p>
To mutate the passed value, we need to pass it by reference, using a pointer.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">type</span> <span style="color: #00ffff;">Artist</span> <span style="color: #00ff00; font-weight: bold;">struct</span> {
        Name, Genre string
        Songs       int
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">newRelease</span>(a *<span style="color: #00ffff;">Artist</span>) <span style="color: #00ffff;">int</span> {
        a.Songs++
        <span style="color: #00ff00; font-weight: bold;">return</span> a.Songs
}

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        me := &amp;<span style="color: #00ffff;">Artist</span>{Name: <span style="color: #ffa500;">"Matt"</span>, Genre: <span style="color: #ffa500;">"Electro"</span>, Songs: 42}
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s has a total of %d songs\n"</span>, me.Name, me.Songs)
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s released their %dth song\n"</span>, me.Name, <span style="color: #00ffff; font-weight: bold;">newRelease</span>(me))
        fmt.<span style="color: #00ffff; font-weight: bold;">Printf</span>(<span style="color: #ffa500;">"%s has a total of %d songs"</span>, me.Name, me.Songs)
}
</pre>
</div>

<pre class="example">
Matt has a total of 42 songs
Matt released their 43th song
Matt has a total of 43 songs

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-26 Thu 16:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
